Tekla Open API Reference for Tekla Structures 2025
Text.GetObjects Method
Overload List
Name | Description
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
Top
See Also
Reference
Text Class
Tekla.Structures.Drawing Namespace